{
    "Wszystko": "All",
    "Technologie": "Technologies",
    "O mnie": "About me",
    "Hase": "Passwords",
    "Projekty": "Projects",
    "Kontakt": "Contact",
    "W moich projektach zawsze stawiam na praktyczno, co przekada si na atwo u偶ytkowania i obsugi. Preferuje nowoczesny styl, gdzie innowacyjno idzie w parze z intuicyjnym designem. Poza estetyk, liczy si dla mnie funkcjonalno, tak aby zapewnia u偶ytkownikom wyjtkowe dowiadczenia. ":"In my projects, I always prioritize practicality, translating into ease of use and handling. I prefer a modern style where innovation goes hand in hand with intuitive design. Beyond aesthetics, functionality is crucial for me to ensure providing users with exceptional experiences. ",
    "O stronie":"About site",
    "Zachcam do wgldu i polecam dark mode":"I encourage you to take a look and recommend dark mode",
    "Jestem otwart i ambitn osob. Interesuje si wieloma rzeczami od tematyki redniowiecza po astronomie przez giede, sztuk, gry komputerowe, rozw贸j osobisty i wiele wicej. Odwiedziem ponad 50 kraj贸w i od lat jestem sportowcem co mocno wpyno na uksztatowanie mojej gowy w d偶eniu po wyznaczone cele. W 2022 ukoczyem studia wy偶sze kwalifikujc si do stypendium a aktualnie szukam miejsca pracy w kt贸rym bde m贸g rozwija umiejtnoci.":"I am an open and ambitious person. I am interesting in many things from the Middle Ages to astronomy, through stock exchange, computer games, personal development and much more. I have visited over 50 countries and have been an athlete for years, which influenced for the shape of my brain in pursuit after achieving goals. in 2022 I graduated from school qualifying for a scholarship and now I am looking for a job where I can develop my skills.",
    "Posiadam dwa lata dowiadczenia w programowaniu. Napisaem kilkadziesit tysicy lini kodu, rozwizujc przy tym niezliczone iloci problem贸w. Programowaem zar贸wno frontend jak i backend, nie s mi r贸wnie偶 obce bazy danych. Biege korzystanie ze sztucznej inteligencji dodatkowo przypiesza i uatwia mi proces pisania i rozumienia kodu a w wolnych chwilach, u偶ywam AI do tworzenia komercyjnych produkt贸w cyfrowych.":"I have two years of experience in programming. I have written tens of thousands of lines of code, solving countless problems along the way. I have experience in both frontend and backend development, and I am also familiar with databases. Proficient use of artificial intelligence additionally speeds up and facilitates the process of writing and understanding code for me, and in my spare time, I use AI to create commercial digital products.",
    "Jzyki":"Languages",
    "Bazy danych":"Database",
    "Systemy":"Systems",
    "Narzdzia":"Tools",
    "Frameworki":"Frameworks",
    "Inne":"Other",
    "Czat GPT":"Chat GPT",
    "R贸wnie偶 korzystaem":"Also used",
    "Przydatne narzdzia, gry + dodatkowe funkcje po utorzeniu konta":"Useful tools, games + additional features after creating an account",
    "Szybkie sprawdzenie parametr贸w komputera dla systemu Windows":"Quick PC specs check for Windows",
    "Tworzenie treci HTML, z podanych wartoci w Pythonie + manipulowanie kolorami":"Creating HTML content, from given values in Python + color manipulation",
    "Tworzenie prywatnego portfolio ze zdjciami w Django":"Creating a private photo portfolio in Django",
    "Pobierz":"Download",
    "Kod贸w QR":"QR codes",
    "Kolor贸w":"Colors",
    "Cytat贸w":"Quotes",
    "Ciekawostek":"Curiosities",
    "Kalkulator":"Calculator",
    "Standardowy":"Standard",
    "Zapotrzebowania kcal":"Kcal needs",
    "Stopni":"Dagrees",
    "Miary":"Measure",
    "Finanse":"Finances",
    "Waluty":"Currencies",
    "Kryptowaluty":"Cryptocurrencies",
    "R贸偶ne":"Other",
    "Pogoda":"Weather",
    "Mapa":"Map",
    "Zaloguj":"Login",
    "Wpisz wybran tre a otrzymasz kod QR z jej zawartoci":"Enter the selected content and you will receive a QR code with its content",
    "Kliknij w przycisk a otrzymasz skplikowane haso, kliknij je aby skopiowa":"Click on the button and you will get a complicated password, click it to copy it",
    "Wygeneruj losowy kolor, kliknij go aby skopiowa":"Generate a random color, click it to copy",
    "Wygeneruj losowy cytat":"Generate a random quote",
    "Wygeneruj losow ciekawost":"Generate a random curiosity",
    "K":"F",
    "Waga (kg):":"Weight (kg)",
    "Wzrost (cm):":"Height (cm)",
    "Oblicz":"Calculate",
    "Generuj":"Generate",
    "Generuj haso":"Generate password",
    "Pomylnie skopiowano!":"Successfully copied!",
    "Generuj kolor":"Generate color",
    "Generuj cytat":"Generate a quote",
    "Wiek":"Age",
    "Zeruj":"Clear",
    "rednia cena walut na dzi:":"Average currency price today:",
    "Aktualne ceny najpopularniejszych kryptowalut:":"Current prices of the most popular cryptocurrencies:",
    "Wprowad藕 nazw miasta aby otrzyma informacje pogodowe":"Enter a city name to get weather information",
    "Sprawd藕":"Check",
    "Haso":"Password",
    "Rejestracja":"Registration",
    "Nie pamitasz hasa?":"You don't remember password?",
    "Zapamitaj haso":"Remember password",
    "Wylij":"Send",
    "Logowanie":"Login",
    "Potwierd藕 haso":"Confirm password",
    "Przejd藕":"Go to",
    "Uwaga! system logowania/rejestracji jest jedynie wizualizacjze wzgldu na brak poczenia z baz danych w hostingu github":"Attention! the login/registration system is just a visualization due to the lack of a database connection in github hosting"
}