{
    "Wszystko": "All",
    "Technologie": "Technologies",
    "O mnie": "About me",
    "Haseł": "Passwords",
    "Projekty": "Projects",
    "Kontakt": "Contact",
    "Jest to strona z licznymi narzędziami i funkcjonalnościami zrealizowany w modernistycznym stylu pełniący rolę wizytówki. Ponadto umożliwia pobranie większości zrealizowanych autorskich projektów a także odwiedzenie reszty moich stron. Zachęcam do wglądu i polecam dark mode.":"It is a website with many tools and functionalities, created in a modernist style, performs functions as a business card. In addition, it allows you to download most of the completed original projects as well as visit the rest of my pages. I recommend you to take a look and use dark mode.",
    "O stronie":"About site",
    "Zachęcam do wglądu i polecam dark mode":"I encourage you to take a look and recommend dark mode",
    "Jestem otwartą kreatywną i ambitną osobą. Interesuje się wieloma rzeczami od tematyki średniowiecza po astronomie przez giełde, sztukę, gry komputerowe, rozwój osobisty i wiele więcej. Odwiedziłem ponad 50 krajów i od lat jestem sportowcem co mocno wpłynęło na ukształtowanie mojej głowy w dążeniu po wyznaczone cele. W 2022 ukończyłem studia wyższe kwalifikując się do stypendium a aktualnie szukam miejsca pracy w którym będe mógł rozwijać umiejętności i uczyć się nowych technologii.":"I am an open creative and ambitious person. I'am interesting in many things from the Middle Ages to astronomy, through stock exchange, computer games, personal development and much more. I have visited over 50 countries and have been an athlete for years, which influenced for the shape of my brain in pursuit after achieving goals. in 2022 I graduated from school qualifying for a scholarship and now I'am looking for a job where I can develop my skills and learn new technologies.",
    "Programowanie zacząłem od lekkiego frontendu pisząc niedynamiczne strony. Uważałem to wtedy za podstawy podstaw, lecz od początku chciałem nauczyć się Pythona ze względu na czytelność i wysoką ekspresję kodu. Z czasem sukcesywnie poznawałem nowe narzędzia i technologie takie jak bazy danych, biblioteki i frameworki. Tworząc backend w tym przypadku w Django, czułem niedosyt szerszych umiejętności frontendowych aby realizować oprawę graficzną, zgodną z moją wizją a chciałem żeby projekty były dopracowane zarówno ze strony backendu jak i frontendu. Postanowiłem więc wejść na wyższy poziom, ucząc się JavaScripta, douczając CSSa i utrwalając backend, gdyż mogłem poświęcać na to dużo czasu. Strona ta przedstawia moją pracę na obu tych płaszczyznach.":"I started programming with a lightweight frontend writing non-dynamic pages. I considered it the basics of the basics at the time, but from the beginning I wanted to learn Python because of the readability and high expressiveness of the code. Over time, I gradually got to know new tools and technologies such as databases, libraries and frameworks. Creating the backend in this case in Django, I felt a lack of frontend skills to implement the graphic design in line with my vision, and I wanted the projects to be refined both from the backend and frontend side. So I decided to go to the next level, learning JavaScript, CSS and still learning the backend, because I could spend a lot of time on it. This page presents my work on both these levels.",
    "Języki":"Languages",
    "Bazy danych":"Database",
    "Systemy":"Systems",
    "Narzędzia":"Tools",
    "Frameworki":"Frameworks",
    "Inne":"Other",
    "Konsola/Wiersz poleceń":"Console/Command prompt",
    "Komponenty komputera":"Computer components",
    "Czat GPT":"Chat GPT",
    "Przydatne narzędzia, gry + dodatkowe funkcje po utorzeniu konta":"Useful tools, games + additional features after creating an account",
    "Szybkie sprawdzenie parametrów komputera dla systemu Windows":"Quick PC specs check for Windows",
    "Tworzenie treści HTML, z podanych wartości w Pythonie + manipulowanie kolorami":"Creating HTML content, from given values ​​in Python + color manipulation",
    "Tworzenie prywatnego portfolio ze zdjęciami w Django":"Creating a private photo portfolio in Django",
    "Pobierz":"Download",
    "Kodów QR":"QR codes",
    "Kolorów":"Colors",
    "Cytatów":"Quotes",
    "Ciekawostek":"Curiosities",
    "Kalkulator":"Calculator",
    "Standardowy":"Standard",
    "Zapotrzebowania kcal":"Kcal needs",
    "Stopni":"Dagrees",
    "Miary":"Measure",
    "Finanse":"Finances",
    "Waluty":"Currencies",
    "Kryptowaluty":"Cryptocurrencies",
    "Różne":"Other",
    "Pogoda":"Weather",
    "Mapa":"Map",
    "Zaloguj":"Login",
    "Wpisz wybraną treść a otrzymasz kod QR z jej zawartością":"Enter the selected content and you will receive a QR code with its content",
    "Kliknij w przycisk a otrzymasz skąplikowane hasło, kliknij je aby skopiować":"Click on the button and you will get a complicated password, click it to copy it",
    "Wygeneruj losowy kolor, kliknij go aby skopiować":"Generate a random color, click it to copy",
    "Wygeneruj losowy cytat":"Generate a random quote",
    "Wygeneruj losową ciekawostę":"Generate a random curiosity",
    "K":"F",
    "Waga (kg):":"Weight (kg)",
    "Wzrost (cm):":"Height (cm)",
    "Oblicz":"Calculate",
    "Generuj":"Generate",
    "Generuj hasło":"Generate password",
    "Pomyślnie skopiowano!":"Successfully copied!",
    "Generuj kolor":"Generate color",
    "Generuj cytat":"Generate a quote",
    "Wiek":"Age",
    "Zeruj":"Clear",
    "Średnia cena walut na dziś:":"Average currency price today:",
    "Aktualne ceny najpopularniejszych kryptowalut:":"Current prices of the most popular cryptocurrencies:",
    "Wprowadź nazwę miasta aby otrzymać informacje pogodowe":"Enter a city name to get weather information",
    "Sprawdź":"Check",
    "Hasło":"Password",
    "Rejestracja":"Registration",
    "Nie pamiętasz hasła?":"You don't remember password?",
    "Zapamiętaj hasło":"Remember password",
    "Wyślij":"Send",
    "Logowanie":"Login",
    "Potwierdź hasło":"Confirm password",
    "Przejdź":"Go to",
    "Uwaga! system logowania/rejestracji jest jedynie wizualizacjąze względu na brak połączenia z bazą danych w hostingu github":"Attention! the login/registration system is just a visualization due to the lack of a database connection in github hosting"
}