{
    "Wszystko": "All",
    "Technologie": "Technologies",
    "O mnie": "About me",
    "Hase": "Passwords",
    "Projekty": "Projects",
    "Kontakt": "Contact",
    "Jest to strona z licznymi narzdziami i funkcjonalnociami kt贸r napisaem w celu realizacji autorskiej wizyt贸wki. Umo偶liwia r贸wnie偶 przegld projekt贸w i odwiedzenie reszty moich stron. Zachcam do wgldu i polecam dark mode. ":"This is a page with numerous tools and functionalities that I have created to serve as a personal portfolio. It also allows you to browse my projects and visit the rest of my websites. Feel free to explore, and I recommend using dark mode. ",
    "O stronie":"About site",
    "Zachcam do wgldu i polecam dark mode":"I encourage you to take a look and recommend dark mode",
    "Jestem otwart i ambitn osob. Interesuje si wieloma rzeczami od tematyki redniowiecza po astronomie przez giede, sztuk, gry komputerowe, rozw贸j osobisty i wiele wicej. Odwiedziem ponad 50 kraj贸w i od lat jestem sportowcem co mocno wpyno na uksztatowanie mojej gowy w d偶eniu po wyznaczone cele. W 2022 ukoczyem studia wy偶sze kwalifikujc si do stypendium a aktualnie szukam miejsca pracy w kt贸rym bde m贸g rozwija umiejtnoci i uczy si nowych technologii.":"I am an open and ambitious person. I am interesting in many things from the Middle Ages to astronomy, through stock exchange, computer games, personal development and much more. I have visited over 50 countries and have been an athlete for years, which influenced for the shape of my brain in pursuit after achieving goals. in 2022 I graduated from school qualifying for a scholarship and now I am looking for a job where I can develop my skills and learn new technologies.",
    "Posiadam ponad rok dowiadczenia niekomercyjnego w programowaniu. Napisaem kilkadziesit tysicy lini kodu, rozwizujc przy tym niezliczone iloci problem贸w. Programowaem zar贸wno frontend jak i backend, nie s mi r贸wnie偶 obce bazy danych. Jzykiem w kt贸rym chc si rozwija jest JavaScript poniewa偶 cz obie te paszczyzny a dodajc do tego React daje niemal nieograniczone mo偶liwoci. Biege korzystanie ze sztucznej inteligencji dodatkowo przypiesza i uatwia mi proces pisania i rozumienia kodu.":"I have over a year of non-commercial programming experience. I have written tens of thousands of lines of code, solving countless problems along the way. I have experience in both frontend and backend development, and I am also familiar with databases. The language I want to specialize in is JavaScript because it bridges both of these aspects, and when combined with React, it offers nearly limitless possibilities. Proficient use of artificial intelligence further accelerates and facilitates my coding and code comprehension process.",
    "Jzyki":"Languages",
    "Bazy danych":"Database",
    "Systemy":"Systems",
    "Narzdzia":"Tools",
    "Frameworki":"Frameworks",
    "Inne":"Other",
    "Konsola/Wiersz polece":"Console/Command prompt",
    "Komponenty komputera":"Computer components",
    "Czat GPT":"Chat GPT",
    "Przydatne narzdzia, gry + dodatkowe funkcje po utorzeniu konta":"Useful tools, games + additional features after creating an account",
    "Szybkie sprawdzenie parametr贸w komputera dla systemu Windows":"Quick PC specs check for Windows",
    "Tworzenie treci HTML, z podanych wartoci w Pythonie + manipulowanie kolorami":"Creating HTML content, from given values in Python + color manipulation",
    "Tworzenie prywatnego portfolio ze zdjciami w Django":"Creating a private photo portfolio in Django",
    "Pobierz":"Download",
    "Kod贸w QR":"QR codes",
    "Kolor贸w":"Colors",
    "Cytat贸w":"Quotes",
    "Ciekawostek":"Curiosities",
    "Kalkulator":"Calculator",
    "Standardowy":"Standard",
    "Zapotrzebowania kcal":"Kcal needs",
    "Stopni":"Dagrees",
    "Miary":"Measure",
    "Finanse":"Finances",
    "Waluty":"Currencies",
    "Kryptowaluty":"Cryptocurrencies",
    "R贸偶ne":"Other",
    "Pogoda":"Weather",
    "Mapa":"Map",
    "Zaloguj":"Login",
    "Wpisz wybran tre a otrzymasz kod QR z jej zawartoci":"Enter the selected content and you will receive a QR code with its content",
    "Kliknij w przycisk a otrzymasz skplikowane haso, kliknij je aby skopiowa":"Click on the button and you will get a complicated password, click it to copy it",
    "Wygeneruj losowy kolor, kliknij go aby skopiowa":"Generate a random color, click it to copy",
    "Wygeneruj losowy cytat":"Generate a random quote",
    "Wygeneruj losow ciekawost":"Generate a random curiosity",
    "K":"F",
    "Waga (kg):":"Weight (kg)",
    "Wzrost (cm):":"Height (cm)",
    "Oblicz":"Calculate",
    "Generuj":"Generate",
    "Generuj haso":"Generate password",
    "Pomylnie skopiowano!":"Successfully copied!",
    "Generuj kolor":"Generate color",
    "Generuj cytat":"Generate a quote",
    "Wiek":"Age",
    "Zeruj":"Clear",
    "rednia cena walut na dzi:":"Average currency price today:",
    "Aktualne ceny najpopularniejszych kryptowalut:":"Current prices of the most popular cryptocurrencies:",
    "Wprowad藕 nazw miasta aby otrzyma informacje pogodowe":"Enter a city name to get weather information",
    "Sprawd藕":"Check",
    "Haso":"Password",
    "Rejestracja":"Registration",
    "Nie pamitasz hasa?":"You don't remember password?",
    "Zapamitaj haso":"Remember password",
    "Wylij":"Send",
    "Logowanie":"Login",
    "Potwierd藕 haso":"Confirm password",
    "Przejd藕":"Go to",
    "Uwaga! system logowania/rejestracji jest jedynie wizualizacjze wzgldu na brak poczenia z baz danych w hostingu github":"Attention! the login/registration system is just a visualization due to the lack of a database connection in github hosting"
}